
## Plan Result (fxa-webhook-proxy-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/90027)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9
* Replace
  * aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512 must be replaced
+/- resource "aws_api_gateway_deployment" "apigateway-lambda_api-gateway-deployment_3AF9B512" {
      ~ created_date  = "2024-03-15T22:00:29Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:996905175585:b1aoz7w8yj/" -> (known after apply)
      ~ id            = "zyhw11" -> (known after apply)
      ~ invoke_url    = "https://b1aoz7w8yj.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "deployedAt"   = "1710540001815" -> "1710540397779"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9 will be updated in-place
  ~ resource "aws_api_gateway_stage" "apigateway-lambda_api-gateway-stage_E95B0DF9" {
      ~ deployment_id         = "zyhw11" -> (known after apply)
        id                    = "ags-b1aoz7w8yj-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"671ba044-1cdb-4c52-a2dd-46fbe4f77c82","JobName":"fxa-webhook-proxy_infrastructure_plan_prod","PRNumber":307,"Program":"tfcmt","SHA1":"b7fa9826d3ef57617ce071a9deecc883222cfa2e","Target":"fxa-webhook-proxy-cdk","Vars":{}} -->